> result: {}
    > foo (set): ƒ foo(x) {}
        > arguments (get): ƒ ()
        > arguments (set): ƒ ()
        > caller (get): ƒ ()
        > caller (set): ƒ ()
        length: 1
        name: 'set foo'
        [[FunctionLocation]]: @ <eval>/VM<xx>:1
        > [[Prototype]]: ƒ ()
        > [[Scopes]]: Scopes[1]
    > [[Prototype]]: Object
        > foo (set): ƒ foo(x) {}
        > [[Prototype]]: Object
        > foo (set): ƒ foo(x) {}
        > [[Prototype]]: Object
        > arguments (get): ƒ ()
        > arguments (set): ƒ ()
        > caller (get): ƒ ()
        > caller (set): ƒ ()
        length: 1
        > [[Prototype]]: ƒ ()
        > [[Scopes]]: Scopes[0]

> result: {}
    foo: 42
    > [[Prototype]]: Object
        foo: 42
        > [[Prototype]]: Object
        foo: 42
        > [[Prototype]]: Object
        > arguments (get): ƒ ()
        > arguments (set): ƒ ()
        > caller (get): ƒ ()
        > caller (set): ƒ ()
        length: 1
        > [[Prototype]]: ƒ ()
        > [[Scopes]]: Scopes[0]

> result: {}
    > foo (get): ƒ foo() { throw 'wat'; }
        > arguments (get): ƒ ()
        > arguments (set): ƒ ()
        > caller (get): ƒ ()
        > caller (set): ƒ ()
        length: 0
        name: 'get foo'
        [[FunctionLocation]]: @ <eval>/VM<xx>:1
        > [[Prototype]]: ƒ ()
        > [[Scopes]]: Scopes[1]
    > [[Prototype]]: Object
        > foo (get): ƒ foo() { throw 'wat'; }
        > [[Prototype]]: Object
        > foo (get): ƒ foo() { throw 'wat'; }
        > [[Prototype]]: Object
        > arguments (get): ƒ ()
        > arguments (set): ƒ ()
        > caller (get): ƒ ()
        > caller (set): ƒ ()
        length: 1
        > [[Prototype]]: ƒ ()
        > [[Scopes]]: Scopes[0]

> result: {}
    > [[Prototype]]: Object
        normalObject: true
        > [[Prototype]]: Object
        normalObject: true
        > [[Prototype]]: Object
        > arguments (get): ƒ ()
        > arguments (set): ƒ ()
        > caller (get): ƒ ()
        > caller (set): ƒ ()
        length: 1
        > [[Prototype]]: ƒ ()
        > [[Scopes]]: Scopes[0]

